; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	spectrograph6 - mode
	infrared4 - mode
	infrared1 - mode
	thermograph5 - mode
	infrared2 - mode
	image0 - mode
	infrared3 - mode
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 infrared4)
	(supports instrument0 infrared3)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument1 infrared3)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument2 image0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 infrared2)
	(supports instrument3 image0)
	(supports instrument3 thermograph5)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 thermograph5)
	(supports instrument4 spectrograph6)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
	(supports instrument5 spectrograph6)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
	(supports instrument7 thermograph5)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation0)
	(calibration_target instrument7 GroundStation4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
	(supports instrument8 infrared1)
	(supports instrument8 image0)
	(supports instrument8 infrared2)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 infrared4)
	(supports instrument9 image0)
	(calibration_target instrument9 GroundStation5)
	(calibration_target instrument9 GroundStation3)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet11)
)
(:goal (and
	(have_image Phenomenon6 image0)
	(have_image Phenomenon6 infrared2)
	(have_image Star7 infrared4)
	(have_image Planet8 spectrograph6)
	(have_image Planet8 image0)
	(have_image Phenomenon9 thermograph5)
	(have_image Phenomenon9 infrared2)
	(have_image Star10 spectrograph6)
	(have_image Planet11 image0)
))

)

; plan
1. (turn_to satellite3 groundstation5 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 groundstation5)
   goals met: 0 of 9
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 9
3. (calibrate satellite3 instrument5 groundstation5)
   added: (calibrated instrument5)
   goals met: 0 of 9
4. (turn_to satellite3 star10 groundstation5)
   deleted: (pointing satellite3 groundstation5)
   added: (pointing satellite3 star10)
   goals met: 0 of 9
5. (take_image satellite3 star10 instrument5 spectrograph6)
   added: (have_image star10 spectrograph6)
   goals met: 1 of 9
6. (turn_to satellite3 planet8 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 planet8)
   goals met: 1 of 9
7. (turn_to satellite2 groundstation3 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 groundstation3)
   goals met: 1 of 9
8. (turn_to satellite0 groundstation4 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 9
9. (take_image satellite3 planet8 instrument5 spectrograph6)
   added: (have_image planet8 spectrograph6)
   goals met: 2 of 9
10. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 2 of 9
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 9
12. (calibrate satellite2 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 2 of 9
13. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 2 of 9
14. (turn_to satellite0 star7 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star7)
   goals met: 2 of 9
15. (take_image satellite0 star7 instrument0 infrared4)
   added: (have_image star7 infrared4)
   goals met: 3 of 9
16. (turn_to satellite2 phenomenon6 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon6)
   goals met: 3 of 9
17. (take_image satellite2 phenomenon6 instrument3 image0)
   added: (have_image phenomenon6 image0)
   goals met: 4 of 9
18. (take_image satellite2 phenomenon6 instrument3 infrared2)
   added: (have_image phenomenon6 infrared2)
   goals met: 5 of 9
19. (turn_to satellite2 phenomenon9 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon9)
   goals met: 5 of 9
20. (take_image satellite2 phenomenon9 instrument3 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 6 of 9
21. (take_image satellite2 phenomenon9 instrument3 thermograph5)
   added: (have_image phenomenon9 thermograph5)
   goals met: 7 of 9
22. (turn_to satellite2 planet11 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet11)
   goals met: 7 of 9
23. (take_image satellite2 planet11 instrument3 image0)
   added: (have_image planet11 image0)
   goals met: 8 of 9
24. (turn_to satellite2 planet8 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet8)
   goals met: 8 of 9
25. (take_image satellite2 planet8 instrument3 image0)
   added: (have_image planet8 image0)
   goals met: 9 of 9
